----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
   ConvTranspose2d-1            [-1, 512, 4, 4]         770,048
       BatchNorm2d-2            [-1, 512, 4, 4]           1,024
              ReLU-3            [-1, 512, 4, 4]               0
   ConvTranspose2d-4            [-1, 256, 8, 8]       2,097,152
       BatchNorm2d-5            [-1, 256, 8, 8]             512
              ReLU-6            [-1, 256, 8, 8]               0
   ConvTranspose2d-7          [-1, 128, 16, 16]         524,288
       BatchNorm2d-8          [-1, 128, 16, 16]             256
              ReLU-9          [-1, 128, 16, 16]               0
  ConvTranspose2d-10           [-1, 64, 32, 32]         131,072
      BatchNorm2d-11           [-1, 64, 32, 32]             128
             ReLU-12           [-1, 64, 32, 32]               0
  ConvTranspose2d-13           [-1, 32, 64, 64]          32,768
      BatchNorm2d-14           [-1, 32, 64, 64]              64
             ReLU-15           [-1, 32, 64, 64]               0
  ConvTranspose2d-16         [-1, 16, 128, 128]           8,192
      BatchNorm2d-17         [-1, 16, 128, 128]              32
             ReLU-18         [-1, 16, 128, 128]               0
  ConvTranspose2d-19          [-1, 3, 256, 256]             768
             ReLU-20          [-1, 3, 256, 256]               0
  ConvTranspose2d-21          [-1, 3, 256, 256]              81
             Tanh-22          [-1, 3, 256, 256]               0
         Upsample-23        [-1, 3, 1024, 1024]               0
  ConvTranspose2d-24          [-1, 3, 256, 256]             768
             ReLU-25          [-1, 3, 256, 256]               0
  ConvTranspose2d-26          [-1, 3, 256, 256]              81
             Tanh-27          [-1, 3, 256, 256]               0
         Upsample-28        [-1, 3, 1024, 1024]               0
================================================================
Total params: 3,567,234
Trainable params: 3,567,234
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.00
Forward/backward pass size (MB): 71.81
Params size (MB): 13.61
Estimated Total Size (MB): 85.42
----------------------------------------------------------------
Texture Size: [1, 1024, 1024, 3]
torch.Size([1, 3, 1024, 1024]) torch.Size([1, 3, 1024, 1024])
